app/controllers/cursos_controller.rb

  def index
    @cursos = Curso.all
---
SELECT "cursos".* FROM "cursos"

  def show
    @curso = Curso.find(params[:id])
---
SELECT "cursos".* FROM "cursos" WHERE "cursos"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @curso = Curso.find(params[:id])
---
SELECT "cursos".* FROM "cursos" WHERE "cursos"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @curso = Curso.new(params[:curso])

    respond_to do |format|
      if @curso.save
---
INSERT INTO "cursos" ("codigo", "comuna", "created_at", "nombre", "updated_at") VALUES (?, ?, ?, ?, ?)  [["codigo", "12-2013-1"], ["comuna", "Arica"], ["created_at", Wed, 18 Dec 2013 13:14:47 UTC +00:00], ["nombre", "Curso Sofofa"], ["updated_at", Wed, 18 Dec 2013 13:14:47 UTC +00:00]]

  def update
    @curso = Curso.find(params[:id])

    respond_to do |format|
      if @curso.update_attributes(params[:curso])
---
SELECT "cursos".* FROM "cursos" WHERE "cursos"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "cursos" SET "comuna" = 'Vina Del Mar', "updated_at" = '2013-12-18 15:32:32.161241' WHERE "cursos"."id" = 11

  def destroy
    @curso = Curso.find(params[:id])
    @curso.destroy
---
SELECT "cursos".* FROM "cursos" WHERE "cursos"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "cursos" WHERE "cursos"."id" = ?  [["id", 1]]