app/controllers/cursos_controller.rb

  def destroy
    @curso = Curso.find(params[:id])
    @curso.sesions.each do |sesion|
---
SELECT "sesions".* FROM "sesions" WHERE "sesions"."curso_id" = 1