app/controllers/sesions_controller.rb

  def index
    curso_ids = Sesion.where(:user_id => current_user, :active => true).select(:curso_id).group(:curso_id).collect{|p| p.curso_id}
    @cursos = Array.new
    curso_ids.each do |curso_id|
---
SELECT "sesions".* FROM "sesions"