app/controllers/users_controller.rb

  def index
    authorize! :index, @user, :message => 'Not authorized as an administrator.'
    @users = User.all
---
SELECT "users".* FROM "users"

  def create
    authorize! :create, @user, :message => 'Not authorized as an administrator.'
    password = Devise.friendly_token.first(8)
    @user = User.new(:name => params[:user][:name], :email => params[:user][:email], :role_ids => params[:user][:role_ids], :password => password, :password_confirmation => password)
    UserMailer.welcome(@user, password).deliver
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "last_sign_in_at", "last_sign_in_ip", "name", "remember_created_at", "reset_password_sent_at", "reset_password_token", "sign_in_count", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    authorize! :update, @user, :message => 'Not authorized as an administrator.'
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  def destroy
    authorize! :destroy, @user, :message => 'Not authorized as an administrator.'
    user = User.find(params[:id])
    unless user == current_user
      user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 4]]

  def update_password
    @user = User.find(current_user.id)
    password = params[:user][:password]
    #debugger
    if @user.update_attributes(:password => password, :password_confirmation => params[:user][:password_confirmation])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "encrypted_password" = '$2a$10$Tf2zqamvVlNwAk6hEDF1RepiIWKfyqaz.u3Wn9r6dlcgcUeJX9sJi', "updated_at" = '2013-12-17 18:49:34.585450' WHERE "users"."id" = 1